MaterialFoundry/MaterialFoundry_Arduino/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################

materialPlane_Sensor.name=Material Plane Sensor (Production)
materialPlane_Sensor.vid.0=0x16D0
materialPlane_Sensor.pid.0=0x11CE

materialPlane_Sensor.bootloader.tool=esptool_py
materialPlane_Sensor.bootloader.tool.default=esptool_py

materialPlane_Sensor.upload.tool=esptool_py
materialPlane_Sensor.upload.tool.default=esptool_py
materialPlane_Sensor.upload.tool.network=esp_ota

materialPlane_Sensor.upload.maximum_size=1310720
materialPlane_Sensor.upload.maximum_data_size=327680
materialPlane_Sensor.upload.flags=
materialPlane_Sensor.upload.extra_flags=
materialPlane_Sensor.upload.use_1200bps_touch=true
materialPlane_Sensor.upload.wait_for_upload_port=true

materialPlane_Sensor.serial.disableDTR=false
materialPlane_Sensor.serial.disableRTS=false

materialPlane_Sensor.build.tarch=xtensa
materialPlane_Sensor.build.bootloader_addr=0x0
materialPlane_Sensor.build.target=esp32s3
materialPlane_Sensor.build.mcu=esp32s3
materialPlane_Sensor.build.core=esp32
materialPlane_Sensor.build.variant=materialPlane_sensor
materialPlane_Sensor.build.board=ESP32S3_DEV

materialPlane_Sensor.build.usb_mode=0
materialPlane_Sensor.build.cdc_on_boot=1
materialPlane_Sensor.build.msc_on_boot=0
materialPlane_Sensor.build.dfu_on_boot=0
materialPlane_Sensor.build.f_cpu=240000000L
materialPlane_Sensor.build.flash_size=4MB
materialPlane_Sensor.build.flash_freq=80m
materialPlane_Sensor.build.flash_mode=dio
materialPlane_Sensor.build.boot=qio
materialPlane_Sensor.build.boot_freq=80m
materialPlane_Sensor.build.partitions=default
materialPlane_Sensor.build.defines=
materialPlane_Sensor.build.loop_core=
materialPlane_Sensor.build.event_core=
materialPlane_Sensor.build.psram_type=qspi
materialPlane_Sensor.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
materialPlane_Sensor.menu.JTAGAdapter.default=Disabled
materialPlane_Sensor.menu.JTAGAdapter.default.build.copy_jtag_files=0
materialPlane_Sensor.menu.JTAGAdapter.builtin=Integrated USB JTAG
materialPlane_Sensor.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
materialPlane_Sensor.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
materialPlane_Sensor.menu.JTAGAdapter.external=FTDI Adapter
materialPlane_Sensor.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
materialPlane_Sensor.menu.JTAGAdapter.external.build.copy_jtag_files=1
materialPlane_Sensor.menu.JTAGAdapter.bridge=ESP USB Bridge
materialPlane_Sensor.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
materialPlane_Sensor.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

#materialPlane_Sensor.menu.PSRAM.disabled=Disabled
#materialPlane_Sensor.menu.PSRAM.disabled.build.defines=
#materialPlane_Sensor.menu.PSRAM.disabled.build.psram_type=qspi
#materialPlane_Sensor.menu.PSRAM.enabled=QSPI PSRAM
#materialPlane_Sensor.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
#materialPlane_Sensor.menu.PSRAM.enabled.build.psram_type=qspi
#materialPlane_Sensor.menu.PSRAM.opi=OPI PSRAM
#materialPlane_Sensor.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
#materialPlane_Sensor.menu.PSRAM.opi.build.psram_type=opi

#materialPlane_Sensor.menu.FlashMode.qio=QIO 80MHz
#materialPlane_Sensor.menu.FlashMode.qio.build.flash_mode=dio
#materialPlane_Sensor.menu.FlashMode.qio.build.boot=qio
#materialPlane_Sensor.menu.FlashMode.qio.build.boot_freq=80m
#materialPlane_Sensor.menu.FlashMode.qio.build.flash_freq=80m
#materialPlane_Sensor.menu.FlashMode.qio120=QIO 120MHz
#materialPlane_Sensor.menu.FlashMode.qio120.build.flash_mode=dio
#materialPlane_Sensor.menu.FlashMode.qio120.build.boot=qio
#materialPlane_Sensor.menu.FlashMode.qio120.build.boot_freq=120m
#materialPlane_Sensor.menu.FlashMode.qio120.build.flash_freq=80m
#materialPlane_Sensor.menu.FlashMode.dio=DIO 80MHz
#materialPlane_Sensor.menu.FlashMode.dio.build.flash_mode=dio
#materialPlane_Sensor.menu.FlashMode.dio.build.boot=dio
#materialPlane_Sensor.menu.FlashMode.dio.build.boot_freq=80m
#materialPlane_Sensor.menu.FlashMode.dio.build.flash_freq=80m
#materialPlane_Sensor.menu.FlashMode.opi=OPI 80MHz
#materialPlane_Sensor.menu.FlashMode.opi.build.flash_mode=dout
#materialPlane_Sensor.menu.FlashMode.opi.build.boot=opi
#materialPlane_Sensor.menu.FlashMode.opi.build.boot_freq=80m
#materialPlane_Sensor.menu.FlashMode.opi.build.flash_freq=80m

#materialPlane_Sensor.menu.FlashSize.4M=4MB (32Mb)
#materialPlane_Sensor.menu.FlashSize.4M.build.flash_size=4MB
#materialPlane_Sensor.menu.FlashSize.8M=8MB (64Mb)
#materialPlane_Sensor.menu.FlashSize.8M.build.flash_size=8MB
#materialPlane_Sensor.menu.FlashSize.8M.build.partitions=default_8MB
#materialPlane_Sensor.menu.FlashSize.16M=16MB (128Mb)
#materialPlane_Sensor.menu.FlashSize.16M.build.flash_size=16MB
#materialPlane_Sensor.menu.FlashSize.32M=32MB (256Mb)
#materialPlane_Sensor.menu.FlashSize.32M.build.flash_size=32MB

#materialPlane_Sensor.menu.LoopCore.1=Core 1
#materialPlane_Sensor.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
#materialPlane_Sensor.menu.LoopCore.0=Core 0
#materialPlane_Sensor.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

#materialPlane_Sensor.menu.EventsCore.1=Core 1
#materialPlane_Sensor.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
#materialPlane_Sensor.menu.EventsCore.0=Core 0
#materialPlane_Sensor.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

#materialPlane_Sensor.menu.USBMode.hwcdc=Hardware CDC and JTAG
#materialPlane_Sensor.menu.USBMode.hwcdc.build.usb_mode=1
#materialPlane_Sensor.menu.USBMode.default=USB-OTG (TinyUSB)
#materialPlane_Sensor.menu.USBMode.default.build.usb_mode=0

#materialPlane_Sensor.menu.CDCOnBoot.default=Disabled
#materialPlane_Sensor.menu.CDCOnBoot.default.build.cdc_on_boot=0
#materialPlane_Sensor.menu.CDCOnBoot.cdc=Enabled
#materialPlane_Sensor.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

#materialPlane_Sensor.menu.MSCOnBoot.default=Disabled
#materialPlane_Sensor.menu.MSCOnBoot.default.build.msc_on_boot=0
#materialPlane_Sensor.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
#materialPlane_Sensor.menu.MSCOnBoot.msc.build.msc_on_boot=1

