MaterialFoundry/MaterialFoundry_Arduino/boards.txt
materialPlane_sensor_debug.menu.DebugLevel.none=None
materialPlane_sensor_debug.menu.DebugLevel.none.build.code_debug=0
materialPlane_sensor_debug.menu.DebugLevel.error=Error
materialPlane_sensor_debug.menu.DebugLevel.error.build.code_debug=1
materialPlane_sensor_debug.menu.DebugLevel.warn=Warn
materialPlane_sensor_debug.menu.DebugLevel.warn.build.code_debug=2
materialPlane_sensor_debug.menu.DebugLevel.info=Info
materialPlane_sensor_debug.menu.DebugLevel.info.build.code_debug=3
materialPlane_sensor_debug.menu.DebugLevel.debug=Debug
materialPlane_sensor_debug.menu.DebugLevel.debug.build.code_debug=4
materialPlane_sensor_debug.menu.DebugLevel.verbose=Verbose
materialPlane_sensor_debug.menu.DebugLevel.verbose.build.code_debug=5

materialPlane_sensor_debug.menu.EraseFlash.none=Disabled
materialPlane_sensor_debug.menu.EraseFlash.none.upload.erase_cmd=
materialPlane_sensor_debug.menu.EraseFlash.all=Enabled
materialPlane_sensor_debug.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

materialPlane_sensor_diy_full.name=Material Plane Sensor (DIY Full)

materialPlane_sensor_diy_full.bootloader.tool=esptool_py
materialPlane_sensor_diy_full.bootloader.tool.default=esptool_py

materialPlane_sensor_diy_full.upload.tool=esptool_py
materialPlane_sensor_diy_full.upload.tool.default=esptool_py
materialPlane_sensor_diy_full.upload.tool.network=esp_ota

materialPlane_sensor_diy_full.upload.maximum_size=1310720
materialPlane_sensor_diy_full.upload.maximum_data_size=327680
materialPlane_sensor_diy_full.upload.flags=
materialPlane_sensor_diy_full.upload.extra_flags=

materialPlane_sensor_diy_full.serial.disableDTR=true
materialPlane_sensor_diy_full.serial.disableRTS=true

materialPlane_sensor_diy_full.build.tarch=xtensa
materialPlane_sensor_diy_full.build.bootloader_addr=0x1000
materialPlane_sensor_diy_full.build.target=esp32
materialPlane_sensor_diy_full.build.mcu=esp32
materialPlane_sensor_diy_full.build.core=esp32
materialPlane_sensor_diy_full.build.variant=materialPlane_sensor_diy_full
materialPlane_sensor_diy_full.build.board=ESP32_DEV

materialPlane_sensor_diy_full.build.f_cpu=240000000L
materialPlane_sensor_diy_full.build.flash_size=4MB
materialPlane_sensor_diy_full.build.flash_freq=40m
materialPlane_sensor_diy_full.build.flash_mode=dio
materialPlane_sensor_diy_full.build.boot=dio
materialPlane_sensor_diy_full.build.partitions=default
materialPlane_sensor_diy_full.build.defines=
materialPlane_sensor_diy_full.build.loop_core=
materialPlane_sensor_diy_full.build.event_core=

## IDE 2.0 Seems to not update the value
#materialPlane_sensor_diy_full.menu.JTAGAdapter.default=Disabled
#materialPlane_sensor_diy_full.menu.JTAGAdapter.default.build.copy_jtag_files=0
#materialPlane_sensor_diy_full.menu.JTAGAdapter.external=FTDI Adapter
#materialPlane_sensor_diy_full.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
#materialPlane_sensor_diy_full.menu.JTAGAdapter.external.build.copy_jtag_files=1
#materialPlane_sensor_diy_full.menu.JTAGAdapter.bridge=ESP USB Bridge
#materialPlane_sensor_diy_full.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
#materialPlane_sensor_diy_full.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

#materialPlane_sensor_diy_full.menu.PSRAM.disabled=Disabled
#materialPlane_sensor_diy_full.menu.PSRAM.disabled.build.defines=
#materialPlane_sensor_diy_full.menu.PSRAM.disabled.build.extra_libs=
#materialPlane_sensor_diy_full.menu.PSRAM.enabled=Enabled
#materialPlane_sensor_diy_full.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
#materialPlane_sensor_diy_full.menu.PSRAM.enabled.build.extra_libs=

#materialPlane_sensor_diy_full.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.default.build.partitions=default
#materialPlane_sensor_diy_full.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
#materialPlane_sensor_diy_full.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
#materialPlane_sensor_diy_full.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
#materialPlane_sensor_diy_full.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.minimal.build.partitions=minimal
#materialPlane_sensor_diy_full.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.no_ota.build.partitions=no_ota
#materialPlane_sensor_diy_full.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
#materialPlane_sensor_diy_full.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
#materialPlane_sensor_diy_full.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.huge_app.build.partitions=huge_app
#materialPlane_sensor_diy_full.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
#materialPlane_sensor_diy_full.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
#materialPlane_sensor_diy_full.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
#materialPlane_sensor_diy_full.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.fatflash.build.partitions=ffat
#materialPlane_sensor_diy_full.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
#materialPlane_sensor_diy_full.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
#materialPlane_sensor_diy_full.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
#materialPlane_sensor_diy_full.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
#materialPlane_sensor_diy_full.menu.PartitionScheme.rainmaker=RainMaker
#materialPlane_sensor_diy_full.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
#materialPlane_sensor_diy_full.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

