MaterialFoundry/MaterialFoundry_Arduino/boards.txt
#materialPlane_sensor_diy_basic.menu.PSRAM.disabled=Disabled
#materialPlane_sensor_diy_basic.menu.PSRAM.disabled.build.defines=
#materialPlane_sensor_diy_basic.menu.PSRAM.disabled.build.extra_libs=
#materialPlane_sensor_diy_basic.menu.PSRAM.enabled=Enabled
#materialPlane_sensor_diy_basic.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
#materialPlane_sensor_diy_basic.menu.PSRAM.enabled.build.extra_libs=

#materialPlane_sensor_diy_basic.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.default.build.partitions=default
#materialPlane_sensor_diy_basic.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
#materialPlane_sensor_diy_basic.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
#materialPlane_sensor_diy_basic.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
#materialPlane_sensor_diy_basic.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.minimal.build.partitions=minimal
#materialPlane_sensor_diy_basic.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.no_ota.build.partitions=no_ota
#materialPlane_sensor_diy_basic.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
#materialPlane_sensor_diy_basic.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
#materialPlane_sensor_diy_basic.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.huge_app.build.partitions=huge_app
#materialPlane_sensor_diy_basic.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
#materialPlane_sensor_diy_basic.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
#materialPlane_sensor_diy_basic.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
#materialPlane_sensor_diy_basic.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.fatflash.build.partitions=ffat
#materialPlane_sensor_diy_basic.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
#materialPlane_sensor_diy_basic.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
#materialPlane_sensor_diy_basic.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
#materialPlane_sensor_diy_basic.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
#materialPlane_sensor_diy_basic.menu.PartitionScheme.rainmaker=RainMaker
#materialPlane_sensor_diy_basic.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
#materialPlane_sensor_diy_basic.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

#materialPlane_sensor_diy_basic.menu.CPUFreq.240=240MHz (WiFi/BT)
#materialPlane_sensor_diy_basic.menu.CPUFreq.240.build.f_cpu=240000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.160=160MHz (WiFi/BT)
#materialPlane_sensor_diy_basic.menu.CPUFreq.160.build.f_cpu=160000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.80=80MHz (WiFi/BT)
#materialPlane_sensor_diy_basic.menu.CPUFreq.80.build.f_cpu=80000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.40=40MHz (40MHz XTAL)
#materialPlane_sensor_diy_basic.menu.CPUFreq.40.build.f_cpu=40000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.26=26MHz (26MHz XTAL)
#materialPlane_sensor_diy_basic.menu.CPUFreq.26.build.f_cpu=26000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.20=20MHz (40MHz XTAL)
#materialPlane_sensor_diy_basic.menu.CPUFreq.20.build.f_cpu=20000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.13=13MHz (26MHz XTAL)
#materialPlane_sensor_diy_basic.menu.CPUFreq.13.build.f_cpu=13000000L
#materialPlane_sensor_diy_basic.menu.CPUFreq.10=10MHz (40MHz XTAL)
#materialPlane_sensor_diy_basic.menu.CPUFreq.10.build.f_cpu=10000000L

#materialPlane_sensor_diy_basic.menu.FlashMode.qio=QIO
#materialPlane_sensor_diy_basic.menu.FlashMode.qio.build.flash_mode=dio
#materialPlane_sensor_diy_basic.menu.FlashMode.qio.build.boot=qio
#materialPlane_sensor_diy_basic.menu.FlashMode.dio=DIO
#materialPlane_sensor_diy_basic.menu.FlashMode.dio.build.flash_mode=dio
#materialPlane_sensor_diy_basic.menu.FlashMode.dio.build.boot=dio
#materialPlane_sensor_diy_basic.menu.FlashMode.qout=QOUT
#materialPlane_sensor_diy_basic.menu.FlashMode.qout.build.flash_mode=dout
#materialPlane_sensor_diy_basic.menu.FlashMode.qout.build.boot=qout
#materialPlane_sensor_diy_basic.menu.FlashMode.dout=DOUT
#materialPlane_sensor_diy_basic.menu.FlashMode.dout.build.flash_mode=dout
#materialPlane_sensor_diy_basic.menu.FlashMode.dout.build.boot=dout

#materialPlane_sensor_diy_basic.menu.FlashFreq.80=80MHz
#materialPlane_sensor_diy_basic.menu.FlashFreq.80.build.flash_freq=80m
#materialPlane_sensor_diy_basic.menu.FlashFreq.40=40MHz
#materialPlane_sensor_diy_basic.menu.FlashFreq.40.build.flash_freq=40m

#materialPlane_sensor_diy_basic.menu.FlashSize.4M=4MB (32Mb)
#materialPlane_sensor_diy_basic.menu.FlashSize.4M.build.flash_size=4MB
#materialPlane_sensor_diy_basic.menu.FlashSize.8M=8MB (64Mb)
#materialPlane_sensor_diy_basic.menu.FlashSize.8M.build.flash_size=8MB
#materialPlane_sensor_diy_basic.menu.FlashSize.8M.build.partitions=default_8MB
#materialPlane_sensor_diy_basic.menu.FlashSize.2M=2MB (16Mb)
#materialPlane_sensor_diy_basic.menu.FlashSize.2M.build.flash_size=2MB
#materialPlane_sensor_diy_basic.menu.FlashSize.2M.build.partitions=minimal
#materialPlane_sensor_diy_basic.menu.FlashSize.16M=16MB (128Mb)
#materialPlane_sensor_diy_basic.menu.FlashSize.16M.build.flash_size=16MB

materialPlane_sensor_diy_basic.menu.UploadSpeed.921600=921600
materialPlane_sensor_diy_basic.menu.UploadSpeed.921600.upload.speed=921600
materialPlane_sensor_diy_basic.menu.UploadSpeed.115200=115200
materialPlane_sensor_diy_basic.menu.UploadSpeed.115200.upload.speed=115200
materialPlane_sensor_diy_basic.menu.UploadSpeed.256000.windows=256000
materialPlane_sensor_diy_basic.menu.UploadSpeed.256000.upload.speed=256000
materialPlane_sensor_diy_basic.menu.UploadSpeed.230400.windows.upload.speed=256000
materialPlane_sensor_diy_basic.menu.UploadSpeed.230400=230400
materialPlane_sensor_diy_basic.menu.UploadSpeed.230400.upload.speed=230400
materialPlane_sensor_diy_basic.menu.UploadSpeed.460800.linux=460800
materialPlane_sensor_diy_basic.menu.UploadSpeed.460800.macosx=460800
materialPlane_sensor_diy_basic.menu.UploadSpeed.460800.upload.speed=460800
materialPlane_sensor_diy_basic.menu.UploadSpeed.512000.windows=512000
materialPlane_sensor_diy_basic.menu.UploadSpeed.512000.upload.speed=512000

#materialPlane_sensor_diy_basic.menu.LoopCore.1=Core 1
#materialPlane_sensor_diy_basic.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
#materialPlane_sensor_diy_basic.menu.LoopCore.0=Core 0
#materialPlane_sensor_diy_basic.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

#materialPlane_sensor_diy_basic.menu.EventsCore.1=Core 1
#materialPlane_sensor_diy_basic.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
#materialPlane_sensor_diy_basic.menu.EventsCore.0=Core 0
#materialPlane_sensor_diy_basic.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

materialPlane_sensor_diy_basic.menu.DebugLevel.none=None
materialPlane_sensor_diy_basic.menu.DebugLevel.none.build.code_debug=0
materialPlane_sensor_diy_basic.menu.DebugLevel.error=Error
materialPlane_sensor_diy_basic.menu.DebugLevel.error.build.code_debug=1
materialPlane_sensor_diy_basic.menu.DebugLevel.warn=Warn
materialPlane_sensor_diy_basic.menu.DebugLevel.warn.build.code_debug=2
materialPlane_sensor_diy_basic.menu.DebugLevel.info=Info
materialPlane_sensor_diy_basic.menu.DebugLevel.info.build.code_debug=3
materialPlane_sensor_diy_basic.menu.DebugLevel.debug=Debug
materialPlane_sensor_diy_basic.menu.DebugLevel.debug.build.code_debug=4
materialPlane_sensor_diy_basic.menu.DebugLevel.verbose=Verbose
materialPlane_sensor_diy_basic.menu.DebugLevel.verbose.build.code_debug=5

materialPlane_sensor_diy_basic.menu.EraseFlash.none=Disabled
materialPlane_sensor_diy_basic.menu.EraseFlash.none.upload.erase_cmd=
materialPlane_sensor_diy_basic.menu.EraseFlash.all=Enabled
materialPlane_sensor_diy_basic.menu.EraseFlash.all.upload.erase_cmd=-e